Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_to_ireland/rights_of_residence_in_ireland/residence_rights_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Residence rights in Ireland
ga: Cearta cónaithe in Éirinn

source: I am a Lithuanian national living and working in Dublin
ga: Is náisiúnach Liotuánach mé agus táim i mo chónaí agus ag obair i mBaile Átha Cliath

source: I went to the Garda National Immigration Bureau (GNIB) to get a residence permit but was told that I don't need one
ga: Chuaigh mé chuig Biúró Náisiúnta an Gharda Síochána um Inimirce (BNGSI) chun cead cónaithe a fháil ach dúradh liom nach gá dom ceann a fháil?

source: Is this true?
ga: An bhfuil sé seo fíor?

source: Yes, this is correct
ga: Tá sé sin fíor

source: EU nationals do not need a residence permit in order to live and work in Ireland
ga: Ní gá do náisiúnaigh an AE cead cónaithe a fháil le cónaí agus obair in Éirinn

source: You can find out more about residence rights of EU/EEA nationals
ga: Is féidir leat tuilleadh eolais a fháil faoi chearta cónaithe náisiúnach AE/LEE

source: I am an Irish citizen living in France with my Russian same-sex partner
ga: Is saoránach Éireannach mé agus tá mé i mo chónaí sa Fhrainc le mo pháirtí Rúiseach den ghnéas céanna

source: I am moving back to Ireland to work
ga: Táim ag bogadh ar ais go hÉirinn le dul ag obair

source: Is it possible for me to bring my partner to live with me in Ireland?
ga: An féidir liom mo pháirtí a thabhairt le cónaí liom in Éirinn?

source: Yes and this right is set down in law
ga: Is féidir agus tá an ceart seo leagtha síos sa dlí

source: Under EU Regulations if you can establish that you have been living together as a couple for at least the last 2 years, your partner can apply to be recognised as a “permitted family member” after you both arrive in the State
ga: Faoin Rialacháin AE is féidir leat a chruthú go bhfuil sibh i bhur gcónaí le chéile mar lánúin le 2 bhliain anuas ar a laghad, is féidir leis/léi iarratas a chur isteach ar bheith aitheanta mar "bhall teaghlaigh ceadaithe" i ndiaidh don bheirt agaibh teacht go dtí an Stát

source: As a citizen of a visa-required country, your partner will need to apply for a visa before travelling to Ireland
ga: Toisc go bhfuil do pháirtí ina shaoránach de thír dá bhfuil víosa ag teastáil, beidh air/uirthi iarratas a chur isteach ar víosa sula dtaistealaíonn sé/sí go hÉirinn

source: I am a South African woman, married to a German citizen and working in Germany at present
ga: Is bean ón Afraic Theas mé, agus táim pósta le saoránach de chuid na Gearmáine agus ag obair sa Ghearmáin faoi láthair

source: Do I have a right to live and work in Ireland?
ga: An bhfuil sé de chead agam cónaí agus obair in Éirinn?

source: Under EU Regulations, you may accompany your husband if he is moving to Ireland to work
ga: Faoi Rialacháin AE, is féidir leat teacht in éineacht le d'fhear céile má tá sé ag bogadh go hÉirinn le n-obair

source: If he is not moving to Ireland, you are not entitled to live and work here unless you have an employment permit, as you are not a citizen of an EU or EEA member state
ga: Mura bhfuil sé ag bogadh go hÉirinn, níl tú i dteideal cónaí agus obair anseo gan cead fostaíochta, toisc nach saoránach de bhallstát an AE nó an LEE tú

source: I am an Irish citizen
ga: Is saoránach Éireannach mé

source: If I marry my Chinese girlfriend in China, can she come to live with me in Ireland?
ga: Má phósaim mo chailín Síneach sa tSín, an féidir léi teacht chun cónaí liom in Éirinn?

source: As a Chinese citizen, your future wife will need a visa to come to Ireland
ga: Mar saoránach Síneach, beidh ar do chailín víosa a fháil le teacht go hÉirinn

source: She must apply online for a visa
ga: Ba chóir di iarratas ar víosa ar líne a dhéanamh

source: She will have to provide detailed documentation to back up the application
ga: Beidh uirthi cáipéisí sonracha a sholáthar le tacú leis an iarratas

source: I am an Australian married to an Irish citizen and living in Cork
ga: Is Astrálach mé agus táim pósta le saoránach Éireannach agus i mo chónaí i gCorcaigh

source: Can my Australian father come to live with us?
ga: An féidir le m'athair Astrálach teach chun cónaí linn?

source: He is on an Australian state pension
ga: Faigheann sé pinsean stáit Astrálach

source: If your father can show that he can support himself in Ireland and if he has private health insurance, he may come and live in Ireland with you
ga: Más féidir le d'athair a léiriú gur féidir leis é féin a chothú in Éirinn agus má tá árachas sláinte príobháideach aige, is féidir leis teacht chun cónaí leat in Éirinn

source: I have been living and working in Ireland on a work permit for the past 4 years
ga: Tá mé i mo chónaí agus ag obair in Éirinn ar chead oibre le 4 bliana anuas

source: When can I apply for long-term residence?
ga: Cathain is féidir liom iarratas a chur isteach ar chónaí fadtéarmach?

source: If you have worked for 5 consecutive years on a employment permit, you will no longer need an employment permit and you will be given a stamp 4 permission to remain for a year
ga: Má tá obair ar chead fostaíochta le 5 bhliain as a chéile déanta agat, ní gá duit cead fostaíochta a bheith agat a thuilleadh. Tabharfar cead fanacht ar feadh 1 bhliain stampa 4 duit

source: You may apply for long-term residency which is an extended residence permission for a further 5 years
ga: Is féidir leat iarratas a dhéanamh ar chónaí fadtéarmach gur cead fanacht sínte ar feadh 5 bliana é
